MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l11/thirdparty/mspm0l11/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMWPROT3 Bits */
/* LFSS_SPMWPROT3[KEY] Bits */
#define LFSS_SPMWPROT3_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT3_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMWPROT3_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-10-02 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT3[WP_15_3] Bits */
#define LFSS_SPMWPROT3_WP_15_3_OFS               (15)                            /* !< WP_15_3 Offset */
#define LFSS_SPMWPROT3_WP_15_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM15 - DATA3 */
#define LFSS_SPMWPROT3_WP_15_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_15_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_15_2] Bits */
#define LFSS_SPMWPROT3_WP_15_2_OFS               (14)                            /* !< WP_15_2 Offset */
#define LFSS_SPMWPROT3_WP_15_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM15 - DATA2 */
#define LFSS_SPMWPROT3_WP_15_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_15_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_15_1] Bits */
#define LFSS_SPMWPROT3_WP_15_1_OFS               (13)                            /* !< WP_15_1 Offset */
#define LFSS_SPMWPROT3_WP_15_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM15 - DATA1 */
#define LFSS_SPMWPROT3_WP_15_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_15_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_15_0] Bits */
#define LFSS_SPMWPROT3_WP_15_0_OFS               (12)                            /* !< WP_15_0 Offset */
#define LFSS_SPMWPROT3_WP_15_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM15 - DATA0 */
#define LFSS_SPMWPROT3_WP_15_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_15_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_14_3] Bits */
#define LFSS_SPMWPROT3_WP_14_3_OFS               (11)                            /* !< WP_14_3 Offset */
#define LFSS_SPMWPROT3_WP_14_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM14 - DATA3 */
#define LFSS_SPMWPROT3_WP_14_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_14_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_14_2] Bits */
#define LFSS_SPMWPROT3_WP_14_2_OFS               (10)                            /* !< WP_14_2 Offset */
#define LFSS_SPMWPROT3_WP_14_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM14- DATA2 */
#define LFSS_SPMWPROT3_WP_14_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_14_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_14_1] Bits */
#define LFSS_SPMWPROT3_WP_14_1_OFS               (9)                             /* !< WP_14_1 Offset */
#define LFSS_SPMWPROT3_WP_14_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM14 - DATA1 */
#define LFSS_SPMWPROT3_WP_14_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_14_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_14_0] Bits */
#define LFSS_SPMWPROT3_WP_14_0_OFS               (8)                             /* !< WP_14_0 Offset */
#define LFSS_SPMWPROT3_WP_14_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM14 - DATA0 */
#define LFSS_SPMWPROT3_WP_14_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_14_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_13_3] Bits */
#define LFSS_SPMWPROT3_WP_13_3_OFS               (7)                             /* !< WP_13_3 Offset */
#define LFSS_SPMWPROT3_WP_13_3_MASK              ((uint32_t)0x00000080U)         /* !< write protect SPMEM13 - DATA3 */
#define LFSS_SPMWPROT3_WP_13_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_13_3_READONLY          ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_13_2] Bits */
#define LFSS_SPMWPROT3_WP_13_2_OFS               (6)                             /* !< WP_13_2 Offset */
#define LFSS_SPMWPROT3_WP_13_2_MASK              ((uint32_t)0x00000040U)         /* !< write protect SPMEM13 - DATA2 */
#define LFSS_SPMWPROT3_WP_13_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_13_2_READONLY          ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_13_1] Bits */
#define LFSS_SPMWPROT3_WP_13_1_OFS               (5)                             /* !< WP_13_1 Offset */
#define LFSS_SPMWPROT3_WP_13_1_MASK              ((uint32_t)0x00000020U)         /* !< write protect SPMEM13 - DATA1 */
#define LFSS_SPMWPROT3_WP_13_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_13_1_READONLY          ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_13_0] Bits */
#define LFSS_SPMWPROT3_WP_13_0_OFS               (4)                             /* !< WP_13_0 Offset */
#define LFSS_SPMWPROT3_WP_13_0_MASK              ((uint32_t)0x00000010U)         /* !< write protect SPMEM13 - DATA0 */
#define LFSS_SPMWPROT3_WP_13_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_13_0_READONLY          ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_12_3] Bits */
#define LFSS_SPMWPROT3_WP_12_3_OFS               (3)                             /* !< WP_12_3 Offset */
#define LFSS_SPMWPROT3_WP_12_3_MASK              ((uint32_t)0x00000008U)         /* !< write protect SPMEM12 - DATA3 */
#define LFSS_SPMWPROT3_WP_12_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_12_3_READONLY          ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_12_2] Bits */
#define LFSS_SPMWPROT3_WP_12_2_OFS               (2)                             /* !< WP_12_2 Offset */
#define LFSS_SPMWPROT3_WP_12_2_MASK              ((uint32_t)0x00000004U)         /* !< write protect SPMEM12 - DATA2 */
#define LFSS_SPMWPROT3_WP_12_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_12_2_READONLY          ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_12_1] Bits */
#define LFSS_SPMWPROT3_WP_12_1_OFS               (1)                             /* !< WP_12_1 Offset */
#define LFSS_SPMWPROT3_WP_12_1_MASK              ((uint32_t)0x00000002U)         /* !< write protect SPMEM12 - DATA1 */
#define LFSS_SPMWPROT3_WP_12_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_12_1_READONLY          ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT3[WP_12_0] Bits */
#define LFSS_SPMWPROT3_WP_12_0_OFS               (0)                             /* !< WP_12_0 Offset */
#define LFSS_SPMWPROT3_WP_12_0_MASK              ((uint32_t)0x00000001U)         /* !< write protect SPMEM12 - DATA0 */
#define LFSS_SPMWPROT3_WP_12_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT3_WP_12_0_READONLY          ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

/* LFSS_SPMWPROT4 Bits */
/* LFSS_SPMWPROT4[KEY] Bits */
#define LFSS_SPMWPROT4_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT4_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMWPROT4_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-10-02 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT4[WP_19_3] Bits */
#define LFSS_SPMWPROT4_WP_19_3_OFS               (15)                            /* !< WP_19_3 Offset */
#define LFSS_SPMWPROT4_WP_19_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM19 - DATA3 */
#define LFSS_SPMWPROT4_WP_19_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_19_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_19_2] Bits */
#define LFSS_SPMWPROT4_WP_19_2_OFS               (14)                            /* !< WP_19_2 Offset */
#define LFSS_SPMWPROT4_WP_19_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM19 - DATA2 */
#define LFSS_SPMWPROT4_WP_19_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_19_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_19_1] Bits */
#define LFSS_SPMWPROT4_WP_19_1_OFS               (13)                            /* !< WP_19_1 Offset */
#define LFSS_SPMWPROT4_WP_19_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM19 - DATA1 */
#define LFSS_SPMWPROT4_WP_19_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_19_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_19_0] Bits */
#define LFSS_SPMWPROT4_WP_19_0_OFS               (12)                            /* !< WP_19_0 Offset */
#define LFSS_SPMWPROT4_WP_19_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM19 - DATA0 */
#define LFSS_SPMWPROT4_WP_19_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_19_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_18_3] Bits */
#define LFSS_SPMWPROT4_WP_18_3_OFS               (11)                            /* !< WP_18_3 Offset */
#define LFSS_SPMWPROT4_WP_18_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM18 - DATA3 */
#define LFSS_SPMWPROT4_WP_18_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_18_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_18_2] Bits */
#define LFSS_SPMWPROT4_WP_18_2_OFS               (10)                            /* !< WP_18_2 Offset */
#define LFSS_SPMWPROT4_WP_18_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM18- DATA2 */
#define LFSS_SPMWPROT4_WP_18_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_18_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_18_1] Bits */
#define LFSS_SPMWPROT4_WP_18_1_OFS               (9)                             /* !< WP_18_1 Offset */
#define LFSS_SPMWPROT4_WP_18_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM18 - DATA1 */
#define LFSS_SPMWPROT4_WP_18_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_18_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_18_0] Bits */
#define LFSS_SPMWPROT4_WP_18_0_OFS               (8)                             /* !< WP_18_0 Offset */
#define LFSS_SPMWPROT4_WP_18_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM18 - DATA0 */
#define LFSS_SPMWPROT4_WP_18_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_18_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_17_3] Bits */
#define LFSS_SPMWPROT4_WP_17_3_OFS               (7)                             /* !< WP_17_3 Offset */
#define LFSS_SPMWPROT4_WP_17_3_MASK              ((uint32_t)0x00000080U)         /* !< write protect SPMEM17 - DATA3 */
#define LFSS_SPMWPROT4_WP_17_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_17_3_READONLY          ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_17_2] Bits */
#define LFSS_SPMWPROT4_WP_17_2_OFS               (6)                             /* !< WP_17_2 Offset */
#define LFSS_SPMWPROT4_WP_17_2_MASK              ((uint32_t)0x00000040U)         /* !< write protect SPMEM17 - DATA2 */
#define LFSS_SPMWPROT4_WP_17_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_17_2_READONLY          ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_17_1] Bits */
#define LFSS_SPMWPROT4_WP_17_1_OFS               (5)                             /* !< WP_17_1 Offset */
#define LFSS_SPMWPROT4_WP_17_1_MASK              ((uint32_t)0x00000020U)         /* !< write protect SPMEM17 - DATA1 */
#define LFSS_SPMWPROT4_WP_17_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_17_1_READONLY          ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_17_0] Bits */
#define LFSS_SPMWPROT4_WP_17_0_OFS               (4)                             /* !< WP_17_0 Offset */
#define LFSS_SPMWPROT4_WP_17_0_MASK              ((uint32_t)0x00000010U)         /* !< write protect SPMEM17 - DATA0 */
#define LFSS_SPMWPROT4_WP_17_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_17_0_READONLY          ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_16_3] Bits */
#define LFSS_SPMWPROT4_WP_16_3_OFS               (3)                             /* !< WP_16_3 Offset */
#define LFSS_SPMWPROT4_WP_16_3_MASK              ((uint32_t)0x00000008U)         /* !< write protect SPMEM16 - DATA3 */
#define LFSS_SPMWPROT4_WP_16_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_16_3_READONLY          ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_16_2] Bits */
#define LFSS_SPMWPROT4_WP_16_2_OFS               (2)                             /* !< WP_16_2 Offset */
#define LFSS_SPMWPROT4_WP_16_2_MASK              ((uint32_t)0x00000004U)         /* !< write protect SPMEM16 - DATA2 */
#define LFSS_SPMWPROT4_WP_16_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_16_2_READONLY          ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_16_1] Bits */
#define LFSS_SPMWPROT4_WP_16_1_OFS               (1)                             /* !< WP_16_1 Offset */
#define LFSS_SPMWPROT4_WP_16_1_MASK              ((uint32_t)0x00000002U)         /* !< write protect SPMEM16 - DATA1 */
#define LFSS_SPMWPROT4_WP_16_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_16_1_READONLY          ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT4[WP_16_0] Bits */
#define LFSS_SPMWPROT4_WP_16_0_OFS               (0)                             /* !< WP_16_0 Offset */
#define LFSS_SPMWPROT4_WP_16_0_MASK              ((uint32_t)0x00000001U)         /* !< write protect SPMEM16 - DATA0 */
#define LFSS_SPMWPROT4_WP_16_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT4_WP_16_0_READONLY          ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

