MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l11/thirdparty/mspm0l11/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMWPROT5 Bits */
/* LFSS_SPMWPROT5[KEY] Bits */
#define LFSS_SPMWPROT5_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT5_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMWPROT5_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-10-02 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT5[WP_23_3] Bits */
#define LFSS_SPMWPROT5_WP_23_3_OFS               (15)                            /* !< WP_23_3 Offset */
#define LFSS_SPMWPROT5_WP_23_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM23 - DATA3 */
#define LFSS_SPMWPROT5_WP_23_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_23_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_23_2] Bits */
#define LFSS_SPMWPROT5_WP_23_2_OFS               (14)                            /* !< WP_23_2 Offset */
#define LFSS_SPMWPROT5_WP_23_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM23 - DATA2 */
#define LFSS_SPMWPROT5_WP_23_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_23_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_23_1] Bits */
#define LFSS_SPMWPROT5_WP_23_1_OFS               (13)                            /* !< WP_23_1 Offset */
#define LFSS_SPMWPROT5_WP_23_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM23 - DATA1 */
#define LFSS_SPMWPROT5_WP_23_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_23_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_23_0] Bits */
#define LFSS_SPMWPROT5_WP_23_0_OFS               (12)                            /* !< WP_23_0 Offset */
#define LFSS_SPMWPROT5_WP_23_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM23 - DATA0 */
#define LFSS_SPMWPROT5_WP_23_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_23_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_22_3] Bits */
#define LFSS_SPMWPROT5_WP_22_3_OFS               (11)                            /* !< WP_22_3 Offset */
#define LFSS_SPMWPROT5_WP_22_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM22 - DATA3 */
#define LFSS_SPMWPROT5_WP_22_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_22_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_22_2] Bits */
#define LFSS_SPMWPROT5_WP_22_2_OFS               (10)                            /* !< WP_22_2 Offset */
#define LFSS_SPMWPROT5_WP_22_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM22- DATA2 */
#define LFSS_SPMWPROT5_WP_22_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_22_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_22_1] Bits */
#define LFSS_SPMWPROT5_WP_22_1_OFS               (9)                             /* !< WP_22_1 Offset */
#define LFSS_SPMWPROT5_WP_22_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM22 - DATA1 */
#define LFSS_SPMWPROT5_WP_22_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_22_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_22_0] Bits */
#define LFSS_SPMWPROT5_WP_22_0_OFS               (8)                             /* !< WP_22_0 Offset */
#define LFSS_SPMWPROT5_WP_22_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM22 - DATA0 */
#define LFSS_SPMWPROT5_WP_22_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_22_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_21_3] Bits */
#define LFSS_SPMWPROT5_WP_21_3_OFS               (7)                             /* !< WP_21_3 Offset */
#define LFSS_SPMWPROT5_WP_21_3_MASK              ((uint32_t)0x00000080U)         /* !< write protect SPMEM21 - DATA3 */
#define LFSS_SPMWPROT5_WP_21_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_21_3_READONLY          ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_21_2] Bits */
#define LFSS_SPMWPROT5_WP_21_2_OFS               (6)                             /* !< WP_21_2 Offset */
#define LFSS_SPMWPROT5_WP_21_2_MASK              ((uint32_t)0x00000040U)         /* !< write protect SPMEM21 - DATA2 */
#define LFSS_SPMWPROT5_WP_21_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_21_2_READONLY          ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_21_1] Bits */
#define LFSS_SPMWPROT5_WP_21_1_OFS               (5)                             /* !< WP_21_1 Offset */
#define LFSS_SPMWPROT5_WP_21_1_MASK              ((uint32_t)0x00000020U)         /* !< write protect SPMEM21 - DATA1 */
#define LFSS_SPMWPROT5_WP_21_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_21_1_READONLY          ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_21_0] Bits */
#define LFSS_SPMWPROT5_WP_21_0_OFS               (4)                             /* !< WP_21_0 Offset */
#define LFSS_SPMWPROT5_WP_21_0_MASK              ((uint32_t)0x00000010U)         /* !< write protect SPMEM21 - DATA0 */
#define LFSS_SPMWPROT5_WP_21_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_21_0_READONLY          ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_20_3] Bits */
#define LFSS_SPMWPROT5_WP_20_3_OFS               (3)                             /* !< WP_20_3 Offset */
#define LFSS_SPMWPROT5_WP_20_3_MASK              ((uint32_t)0x00000008U)         /* !< write protect SPMEM20 - DATA3 */
#define LFSS_SPMWPROT5_WP_20_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_20_3_READONLY          ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_20_2] Bits */
#define LFSS_SPMWPROT5_WP_20_2_OFS               (2)                             /* !< WP_20_2 Offset */
#define LFSS_SPMWPROT5_WP_20_2_MASK              ((uint32_t)0x00000004U)         /* !< write protect SPMEM20 - DATA2 */
#define LFSS_SPMWPROT5_WP_20_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_20_2_READONLY          ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_20_1] Bits */
#define LFSS_SPMWPROT5_WP_20_1_OFS               (1)                             /* !< WP_20_1 Offset */
#define LFSS_SPMWPROT5_WP_20_1_MASK              ((uint32_t)0x00000002U)         /* !< write protect SPMEM20 - DATA1 */
#define LFSS_SPMWPROT5_WP_20_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_20_1_READONLY          ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT5[WP_20_0] Bits */
#define LFSS_SPMWPROT5_WP_20_0_OFS               (0)                             /* !< WP_20_0 Offset */
#define LFSS_SPMWPROT5_WP_20_0_MASK              ((uint32_t)0x00000001U)         /* !< write protect SPMEM20 - DATA0 */
#define LFSS_SPMWPROT5_WP_20_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT5_WP_20_0_READONLY          ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

/* LFSS_SPMWPROT6 Bits */
/* LFSS_SPMWPROT6[KEY] Bits */
#define LFSS_SPMWPROT6_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT6_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMWPROT6_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-10-02 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT6[WP_27_3] Bits */
#define LFSS_SPMWPROT6_WP_27_3_OFS               (15)                            /* !< WP_27_3 Offset */
#define LFSS_SPMWPROT6_WP_27_3_MASK              ((uint32_t)0x00008000U)         /* !< write protect SPMEM27 - DATA3 */
#define LFSS_SPMWPROT6_WP_27_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_27_3_READONLY          ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_27_2] Bits */
#define LFSS_SPMWPROT6_WP_27_2_OFS               (14)                            /* !< WP_27_2 Offset */
#define LFSS_SPMWPROT6_WP_27_2_MASK              ((uint32_t)0x00004000U)         /* !< write protect SPMEM27 - DATA2 */
#define LFSS_SPMWPROT6_WP_27_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_27_2_READONLY          ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_27_1] Bits */
#define LFSS_SPMWPROT6_WP_27_1_OFS               (13)                            /* !< WP_27_1 Offset */
#define LFSS_SPMWPROT6_WP_27_1_MASK              ((uint32_t)0x00002000U)         /* !< write protect SPMEM27 - DATA1 */
#define LFSS_SPMWPROT6_WP_27_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_27_1_READONLY          ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_27_0] Bits */
#define LFSS_SPMWPROT6_WP_27_0_OFS               (12)                            /* !< WP_27_0 Offset */
#define LFSS_SPMWPROT6_WP_27_0_MASK              ((uint32_t)0x00001000U)         /* !< write protect SPMEM27 - DATA0 */
#define LFSS_SPMWPROT6_WP_27_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_27_0_READONLY          ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_26_3] Bits */
#define LFSS_SPMWPROT6_WP_26_3_OFS               (11)                            /* !< WP_26_3 Offset */
#define LFSS_SPMWPROT6_WP_26_3_MASK              ((uint32_t)0x00000800U)         /* !< write protect SPMEM26 - DATA3 */
#define LFSS_SPMWPROT6_WP_26_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_26_3_READONLY          ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_26_2] Bits */
#define LFSS_SPMWPROT6_WP_26_2_OFS               (10)                            /* !< WP_26_2 Offset */
#define LFSS_SPMWPROT6_WP_26_2_MASK              ((uint32_t)0x00000400U)         /* !< write protect SPMEM26- DATA2 */
#define LFSS_SPMWPROT6_WP_26_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_26_2_READONLY          ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_26_1] Bits */
#define LFSS_SPMWPROT6_WP_26_1_OFS               (9)                             /* !< WP_26_1 Offset */
#define LFSS_SPMWPROT6_WP_26_1_MASK              ((uint32_t)0x00000200U)         /* !< write protect SPMEM26 - DATA1 */
#define LFSS_SPMWPROT6_WP_26_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_26_1_READONLY          ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_26_0] Bits */
#define LFSS_SPMWPROT6_WP_26_0_OFS               (8)                             /* !< WP_26_0 Offset */
#define LFSS_SPMWPROT6_WP_26_0_MASK              ((uint32_t)0x00000100U)         /* !< write protect SPMEM26 - DATA0 */
#define LFSS_SPMWPROT6_WP_26_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_26_0_READONLY          ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_25_3] Bits */
#define LFSS_SPMWPROT6_WP_25_3_OFS               (7)                             /* !< WP_25_3 Offset */
#define LFSS_SPMWPROT6_WP_25_3_MASK              ((uint32_t)0x00000080U)         /* !< write protect SPMEM25 - DATA3 */
#define LFSS_SPMWPROT6_WP_25_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_25_3_READONLY          ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_25_2] Bits */
#define LFSS_SPMWPROT6_WP_25_2_OFS               (6)                             /* !< WP_25_2 Offset */
#define LFSS_SPMWPROT6_WP_25_2_MASK              ((uint32_t)0x00000040U)         /* !< write protect SPMEM25 - DATA2 */
#define LFSS_SPMWPROT6_WP_25_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_25_2_READONLY          ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_25_1] Bits */
#define LFSS_SPMWPROT6_WP_25_1_OFS               (5)                             /* !< WP_25_1 Offset */
#define LFSS_SPMWPROT6_WP_25_1_MASK              ((uint32_t)0x00000020U)         /* !< write protect SPMEM25 - DATA1 */
#define LFSS_SPMWPROT6_WP_25_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_25_1_READONLY          ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_25_0] Bits */
#define LFSS_SPMWPROT6_WP_25_0_OFS               (4)                             /* !< WP_25_0 Offset */
#define LFSS_SPMWPROT6_WP_25_0_MASK              ((uint32_t)0x00000010U)         /* !< write protect SPMEM25 - DATA0 */
#define LFSS_SPMWPROT6_WP_25_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_25_0_READONLY          ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_24_3] Bits */
#define LFSS_SPMWPROT6_WP_24_3_OFS               (3)                             /* !< WP_24_3 Offset */
#define LFSS_SPMWPROT6_WP_24_3_MASK              ((uint32_t)0x00000008U)         /* !< write protect SPMEM24 - DATA3 */
#define LFSS_SPMWPROT6_WP_24_3_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_24_3_READONLY          ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_24_2] Bits */
#define LFSS_SPMWPROT6_WP_24_2_OFS               (2)                             /* !< WP_24_2 Offset */
#define LFSS_SPMWPROT6_WP_24_2_MASK              ((uint32_t)0x00000004U)         /* !< write protect SPMEM24 - DATA2 */
#define LFSS_SPMWPROT6_WP_24_2_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_24_2_READONLY          ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_24_1] Bits */
#define LFSS_SPMWPROT6_WP_24_1_OFS               (1)                             /* !< WP_24_1 Offset */
#define LFSS_SPMWPROT6_WP_24_1_MASK              ((uint32_t)0x00000002U)         /* !< write protect SPMEM24 - DATA1 */
#define LFSS_SPMWPROT6_WP_24_1_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_24_1_READONLY          ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT6[WP_24_0] Bits */
#define LFSS_SPMWPROT6_WP_24_0_OFS               (0)                             /* !< WP_24_0 Offset */
#define LFSS_SPMWPROT6_WP_24_0_MASK              ((uint32_t)0x00000001U)         /* !< write protect SPMEM24 - DATA0 */
#define LFSS_SPMWPROT6_WP_24_0_READWRITE         ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT6_WP_24_0_READONLY          ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

