MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l11/thirdparty/mspm0l11/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMTERASE1 Bits */
/* LFSS_SPMTERASE1[KEY] Bits */
#define LFSS_SPMTERASE1_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE1_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMTERASE1_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be up2025-10-02 the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE1[TE_7_3] Bits */
#define LFSS_SPMTERASE1_TE_7_3_OFS               (15)                            /* !< TE_7_3 Offset */
#define LFSS_SPMTERASE1_TE_7_3_MASK              ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM7 - DATA3 */
#define LFSS_SPMTERASE1_TE_7_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_7_3_ENABLE            ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_7_2] Bits */
#define LFSS_SPMTERASE1_TE_7_2_OFS               (14)                            /* !< TE_7_2 Offset */
#define LFSS_SPMTERASE1_TE_7_2_MASK              ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM7 - DATA2 */
#define LFSS_SPMTERASE1_TE_7_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_7_2_ENABLE            ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_7_1] Bits */
#define LFSS_SPMTERASE1_TE_7_1_OFS               (13)                            /* !< TE_7_1 Offset */
#define LFSS_SPMTERASE1_TE_7_1_MASK              ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM7 - DATA1 */
#define LFSS_SPMTERASE1_TE_7_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_7_1_ENABLE            ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_7_0] Bits */
#define LFSS_SPMTERASE1_TE_7_0_OFS               (12)                            /* !< TE_7_0 Offset */
#define LFSS_SPMTERASE1_TE_7_0_MASK              ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM7 - DATA0 */
#define LFSS_SPMTERASE1_TE_7_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_7_0_ENABLE            ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_6_3] Bits */
#define LFSS_SPMTERASE1_TE_6_3_OFS               (11)                            /* !< TE_6_3 Offset */
#define LFSS_SPMTERASE1_TE_6_3_MASK              ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM6 - DATA3 */
#define LFSS_SPMTERASE1_TE_6_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_6_3_ENABLE            ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_6_2] Bits */
#define LFSS_SPMTERASE1_TE_6_2_OFS               (10)                            /* !< TE_6_2 Offset */
#define LFSS_SPMTERASE1_TE_6_2_MASK              ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM6 - DATA2 */
#define LFSS_SPMTERASE1_TE_6_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_6_2_ENABLE            ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_6_1] Bits */
#define LFSS_SPMTERASE1_TE_6_1_OFS               (9)                             /* !< TE_6_1 Offset */
#define LFSS_SPMTERASE1_TE_6_1_MASK              ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM6 - DATA1 */
#define LFSS_SPMTERASE1_TE_6_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_6_1_ENABLE            ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_6_0] Bits */
#define LFSS_SPMTERASE1_TE_6_0_OFS               (8)                             /* !< TE_6_0 Offset */
#define LFSS_SPMTERASE1_TE_6_0_MASK              ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM6 - DATA0 */
#define LFSS_SPMTERASE1_TE_6_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_6_0_ENABLE            ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_5_3] Bits */
#define LFSS_SPMTERASE1_TE_5_3_OFS               (7)                             /* !< TE_5_3 Offset */
#define LFSS_SPMTERASE1_TE_5_3_MASK              ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM5 - DATA3 */
#define LFSS_SPMTERASE1_TE_5_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_5_3_ENABLE            ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_5_2] Bits */
#define LFSS_SPMTERASE1_TE_5_2_OFS               (6)                             /* !< TE_5_2 Offset */
#define LFSS_SPMTERASE1_TE_5_2_MASK              ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM5 - DATA2 */
#define LFSS_SPMTERASE1_TE_5_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_5_2_ENABLE            ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_5_1] Bits */
#define LFSS_SPMTERASE1_TE_5_1_OFS               (5)                             /* !< TE_5_1 Offset */
#define LFSS_SPMTERASE1_TE_5_1_MASK              ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM5 - DATA1 */
#define LFSS_SPMTERASE1_TE_5_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_5_1_ENABLE            ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_5_0] Bits */
#define LFSS_SPMTERASE1_TE_5_0_OFS               (4)                             /* !< TE_5_0 Offset */
#define LFSS_SPMTERASE1_TE_5_0_MASK              ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM5 - DATA0 */
#define LFSS_SPMTERASE1_TE_5_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_5_0_ENABLE            ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_4_3] Bits */
#define LFSS_SPMTERASE1_TE_4_3_OFS               (3)                             /* !< TE_4_3 Offset */
#define LFSS_SPMTERASE1_TE_4_3_MASK              ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM4 - DATA3 */
#define LFSS_SPMTERASE1_TE_4_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_4_3_ENABLE            ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_4_2] Bits */
#define LFSS_SPMTERASE1_TE_4_2_OFS               (2)                             /* !< TE_4_2 Offset */
#define LFSS_SPMTERASE1_TE_4_2_MASK              ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM4 - DATA2 */
#define LFSS_SPMTERASE1_TE_4_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_4_2_ENABLE            ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_4_1] Bits */
#define LFSS_SPMTERASE1_TE_4_1_OFS               (1)                             /* !< TE_4_1 Offset */
#define LFSS_SPMTERASE1_TE_4_1_MASK              ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM4 - DATA1 */
#define LFSS_SPMTERASE1_TE_4_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_4_1_ENABLE            ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE1[TE_4_0] Bits */
#define LFSS_SPMTERASE1_TE_4_0_OFS               (0)                             /* !< TE_4_0 Offset */
#define LFSS_SPMTERASE1_TE_4_0_MASK              ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM4 - DATA0 */
#define LFSS_SPMTERASE1_TE_4_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE1_TE_4_0_ENABLE            ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

/* LFSS_SPMTERASE2 Bits */
/* LFSS_SPMTERASE2[KEY] Bits */
#define LFSS_SPMTERASE2_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE2_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMTERASE2_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be up2025-10-02 the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE2[TE_11_3] Bits */
#define LFSS_SPMTERASE2_TE_11_3_OFS              (15)                            /* !< TE_11_3 Offset */
#define LFSS_SPMTERASE2_TE_11_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM11 - DATA3 */
#define LFSS_SPMTERASE2_TE_11_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_11_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_11_2] Bits */
#define LFSS_SPMTERASE2_TE_11_2_OFS              (14)                            /* !< TE_11_2 Offset */
#define LFSS_SPMTERASE2_TE_11_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM11 - DATA2 */
#define LFSS_SPMTERASE2_TE_11_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_11_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_11_1] Bits */
#define LFSS_SPMTERASE2_TE_11_1_OFS              (13)                            /* !< TE_11_1 Offset */
#define LFSS_SPMTERASE2_TE_11_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM11 - DATA1 */
#define LFSS_SPMTERASE2_TE_11_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_11_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_11_0] Bits */
#define LFSS_SPMTERASE2_TE_11_0_OFS              (12)                            /* !< TE_11_0 Offset */
#define LFSS_SPMTERASE2_TE_11_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM11 - DATA0 */
#define LFSS_SPMTERASE2_TE_11_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_11_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_10_3] Bits */
#define LFSS_SPMTERASE2_TE_10_3_OFS              (11)                            /* !< TE_10_3 Offset */
#define LFSS_SPMTERASE2_TE_10_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM10 - DATA3 */
#define LFSS_SPMTERASE2_TE_10_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_10_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_10_2] Bits */
#define LFSS_SPMTERASE2_TE_10_2_OFS              (10)                            /* !< TE_10_2 Offset */
#define LFSS_SPMTERASE2_TE_10_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM10 - DATA2 */
#define LFSS_SPMTERASE2_TE_10_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_10_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_10_1] Bits */
#define LFSS_SPMTERASE2_TE_10_1_OFS              (9)                             /* !< TE_10_1 Offset */
#define LFSS_SPMTERASE2_TE_10_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM10 - DATA1 */
#define LFSS_SPMTERASE2_TE_10_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_10_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_10_0] Bits */
#define LFSS_SPMTERASE2_TE_10_0_OFS              (8)                             /* !< TE_10_0 Offset */
#define LFSS_SPMTERASE2_TE_10_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM10 - DATA0 */
#define LFSS_SPMTERASE2_TE_10_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_10_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_9_3] Bits */
#define LFSS_SPMTERASE2_TE_9_3_OFS               (7)                             /* !< TE_9_3 Offset */
#define LFSS_SPMTERASE2_TE_9_3_MASK              ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM9 - DATA3 */
#define LFSS_SPMTERASE2_TE_9_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_9_3_ENABLE            ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_9_2] Bits */
#define LFSS_SPMTERASE2_TE_9_2_OFS               (6)                             /* !< TE_9_2 Offset */
#define LFSS_SPMTERASE2_TE_9_2_MASK              ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM9 - DATA2 */
#define LFSS_SPMTERASE2_TE_9_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_9_2_ENABLE            ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_9_1] Bits */
#define LFSS_SPMTERASE2_TE_9_1_OFS               (5)                             /* !< TE_9_1 Offset */
#define LFSS_SPMTERASE2_TE_9_1_MASK              ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM9 - DATA1 */
#define LFSS_SPMTERASE2_TE_9_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_9_1_ENABLE            ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_9_0] Bits */
#define LFSS_SPMTERASE2_TE_9_0_OFS               (4)                             /* !< TE_9_0 Offset */
#define LFSS_SPMTERASE2_TE_9_0_MASK              ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM9 - DATA0 */
#define LFSS_SPMTERASE2_TE_9_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_9_0_ENABLE            ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_8_3] Bits */
#define LFSS_SPMTERASE2_TE_8_3_OFS               (3)                             /* !< TE_8_3 Offset */
#define LFSS_SPMTERASE2_TE_8_3_MASK              ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM8 - DATA3 */
#define LFSS_SPMTERASE2_TE_8_3_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_8_3_ENABLE            ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_8_2] Bits */
#define LFSS_SPMTERASE2_TE_8_2_OFS               (2)                             /* !< TE_8_2 Offset */
#define LFSS_SPMTERASE2_TE_8_2_MASK              ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM8 - DATA2 */
#define LFSS_SPMTERASE2_TE_8_2_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_8_2_ENABLE            ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_8_1] Bits */
#define LFSS_SPMTERASE2_TE_8_1_OFS               (1)                             /* !< TE_8_1 Offset */
#define LFSS_SPMTERASE2_TE_8_1_MASK              ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM8 - DATA1 */
#define LFSS_SPMTERASE2_TE_8_1_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_8_1_ENABLE            ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE2[TE_8_0] Bits */
#define LFSS_SPMTERASE2_TE_8_0_OFS               (0)                             /* !< TE_8_0 Offset */
#define LFSS_SPMTERASE2_TE_8_0_MASK              ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM8 - DATA0 */
#define LFSS_SPMTERASE2_TE_8_0_DISABLE           ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE2_TE_8_0_ENABLE            ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

