MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l11/thirdparty/mspm0l11/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_SPMTERASE3 Bits */
/* LFSS_SPMTERASE3[KEY] Bits */
#define LFSS_SPMTERASE3_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE3_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMTERASE3_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be up2025-10-02 the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE3[TE_15_3] Bits */
#define LFSS_SPMTERASE3_TE_15_3_OFS              (15)                            /* !< TE_15_3 Offset */
#define LFSS_SPMTERASE3_TE_15_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM15 - DATA3 */
#define LFSS_SPMTERASE3_TE_15_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_15_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_15_2] Bits */
#define LFSS_SPMTERASE3_TE_15_2_OFS              (14)                            /* !< TE_15_2 Offset */
#define LFSS_SPMTERASE3_TE_15_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM15 - DATA2 */
#define LFSS_SPMTERASE3_TE_15_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_15_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_15_1] Bits */
#define LFSS_SPMTERASE3_TE_15_1_OFS              (13)                            /* !< TE_15_1 Offset */
#define LFSS_SPMTERASE3_TE_15_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM15 - DATA1 */
#define LFSS_SPMTERASE3_TE_15_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_15_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_15_0] Bits */
#define LFSS_SPMTERASE3_TE_15_0_OFS              (12)                            /* !< TE_15_0 Offset */
#define LFSS_SPMTERASE3_TE_15_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM15 - DATA0 */
#define LFSS_SPMTERASE3_TE_15_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_15_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_14_3] Bits */
#define LFSS_SPMTERASE3_TE_14_3_OFS              (11)                            /* !< TE_14_3 Offset */
#define LFSS_SPMTERASE3_TE_14_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM14 - DATA3 */
#define LFSS_SPMTERASE3_TE_14_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_14_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_14_2] Bits */
#define LFSS_SPMTERASE3_TE_14_2_OFS              (10)                            /* !< TE_14_2 Offset */
#define LFSS_SPMTERASE3_TE_14_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM14 - DATA2 */
#define LFSS_SPMTERASE3_TE_14_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_14_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_14_1] Bits */
#define LFSS_SPMTERASE3_TE_14_1_OFS              (9)                             /* !< TE_14_1 Offset */
#define LFSS_SPMTERASE3_TE_14_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM14 - DATA1 */
#define LFSS_SPMTERASE3_TE_14_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_14_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_14_0] Bits */
#define LFSS_SPMTERASE3_TE_14_0_OFS              (8)                             /* !< TE_14_0 Offset */
#define LFSS_SPMTERASE3_TE_14_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM14 - DATA0 */
#define LFSS_SPMTERASE3_TE_14_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_14_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_13_3] Bits */
#define LFSS_SPMTERASE3_TE_13_3_OFS              (7)                             /* !< TE_13_3 Offset */
#define LFSS_SPMTERASE3_TE_13_3_MASK             ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM13 - DATA3 */
#define LFSS_SPMTERASE3_TE_13_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_13_3_ENABLE           ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_13_2] Bits */
#define LFSS_SPMTERASE3_TE_13_2_OFS              (6)                             /* !< TE_13_2 Offset */
#define LFSS_SPMTERASE3_TE_13_2_MASK             ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM13 - DATA2 */
#define LFSS_SPMTERASE3_TE_13_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_13_2_ENABLE           ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_13_1] Bits */
#define LFSS_SPMTERASE3_TE_13_1_OFS              (5)                             /* !< TE_13_1 Offset */
#define LFSS_SPMTERASE3_TE_13_1_MASK             ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM13 - DATA1 */
#define LFSS_SPMTERASE3_TE_13_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_13_1_ENABLE           ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_13_0] Bits */
#define LFSS_SPMTERASE3_TE_13_0_OFS              (4)                             /* !< TE_13_0 Offset */
#define LFSS_SPMTERASE3_TE_13_0_MASK             ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM13 - DATA0 */
#define LFSS_SPMTERASE3_TE_13_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_13_0_ENABLE           ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_12_3] Bits */
#define LFSS_SPMTERASE3_TE_12_3_OFS              (3)                             /* !< TE_12_3 Offset */
#define LFSS_SPMTERASE3_TE_12_3_MASK             ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM12 - DATA3 */
#define LFSS_SPMTERASE3_TE_12_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_12_3_ENABLE           ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_12_2] Bits */
#define LFSS_SPMTERASE3_TE_12_2_OFS              (2)                             /* !< TE_12_2 Offset */
#define LFSS_SPMTERASE3_TE_12_2_MASK             ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM12 - DATA2 */
#define LFSS_SPMTERASE3_TE_12_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_12_2_ENABLE           ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_12_1] Bits */
#define LFSS_SPMTERASE3_TE_12_1_OFS              (1)                             /* !< TE_12_1 Offset */
#define LFSS_SPMTERASE3_TE_12_1_MASK             ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM12 - DATA1 */
#define LFSS_SPMTERASE3_TE_12_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_12_1_ENABLE           ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE3[TE_12_0] Bits */
#define LFSS_SPMTERASE3_TE_12_0_OFS              (0)                             /* !< TE_12_0 Offset */
#define LFSS_SPMTERASE3_TE_12_0_MASK             ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM12 - DATA0 */
#define LFSS_SPMTERASE3_TE_12_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE3_TE_12_0_ENABLE           ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

/* LFSS_SPMTERASE4 Bits */
/* LFSS_SPMTERASE4[KEY] Bits */
#define LFSS_SPMTERASE4_KEY_OFS                  (24)                            /* !< KEY Offset */
#define LFSS_SPMTERASE4_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xA3) to up2025-10-02
                                                                                    this register */
#define LFSS_SPMTERASE4_KEY_UNLOCK_W             ((uint32_t)0xA3000000U)         /* !< This field must be written with
                                                                                    0xA3 to be up2025-10-02 the tamper erase
                                                                                    enable bit. */
/* LFSS_SPMTERASE4[TE_19_3] Bits */
#define LFSS_SPMTERASE4_TE_19_3_OFS              (15)                            /* !< TE_19_3 Offset */
#define LFSS_SPMTERASE4_TE_19_3_MASK             ((uint32_t)0x00008000U)         /* !< tamper erase enable SPMEM19 - DATA3 */
#define LFSS_SPMTERASE4_TE_19_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_19_3_ENABLE           ((uint32_t)0x00008000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_19_2] Bits */
#define LFSS_SPMTERASE4_TE_19_2_OFS              (14)                            /* !< TE_19_2 Offset */
#define LFSS_SPMTERASE4_TE_19_2_MASK             ((uint32_t)0x00004000U)         /* !< tamper erase enable SPMEM19 - DATA2 */
#define LFSS_SPMTERASE4_TE_19_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_19_2_ENABLE           ((uint32_t)0x00004000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_19_1] Bits */
#define LFSS_SPMTERASE4_TE_19_1_OFS              (13)                            /* !< TE_19_1 Offset */
#define LFSS_SPMTERASE4_TE_19_1_MASK             ((uint32_t)0x00002000U)         /* !< tamper erase enable SPMEM19 - DATA1 */
#define LFSS_SPMTERASE4_TE_19_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_19_1_ENABLE           ((uint32_t)0x00002000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_19_0] Bits */
#define LFSS_SPMTERASE4_TE_19_0_OFS              (12)                            /* !< TE_19_0 Offset */
#define LFSS_SPMTERASE4_TE_19_0_MASK             ((uint32_t)0x00001000U)         /* !< tamper erase enable SPMEM19 - DATA0 */
#define LFSS_SPMTERASE4_TE_19_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_19_0_ENABLE           ((uint32_t)0x00001000U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_18_3] Bits */
#define LFSS_SPMTERASE4_TE_18_3_OFS              (11)                            /* !< TE_18_3 Offset */
#define LFSS_SPMTERASE4_TE_18_3_MASK             ((uint32_t)0x00000800U)         /* !< tamper erase enable SPMEM18 - DATA3 */
#define LFSS_SPMTERASE4_TE_18_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_18_3_ENABLE           ((uint32_t)0x00000800U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_18_2] Bits */
#define LFSS_SPMTERASE4_TE_18_2_OFS              (10)                            /* !< TE_18_2 Offset */
#define LFSS_SPMTERASE4_TE_18_2_MASK             ((uint32_t)0x00000400U)         /* !< tamper erase enable SPMEM18 - DATA2 */
#define LFSS_SPMTERASE4_TE_18_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_18_2_ENABLE           ((uint32_t)0x00000400U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_18_1] Bits */
#define LFSS_SPMTERASE4_TE_18_1_OFS              (9)                             /* !< TE_18_1 Offset */
#define LFSS_SPMTERASE4_TE_18_1_MASK             ((uint32_t)0x00000200U)         /* !< tamper erase enable SPMEM18 - DATA1 */
#define LFSS_SPMTERASE4_TE_18_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_18_1_ENABLE           ((uint32_t)0x00000200U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_18_0] Bits */
#define LFSS_SPMTERASE4_TE_18_0_OFS              (8)                             /* !< TE_18_0 Offset */
#define LFSS_SPMTERASE4_TE_18_0_MASK             ((uint32_t)0x00000100U)         /* !< tamper erase enable SPMEM18 - DATA0 */
#define LFSS_SPMTERASE4_TE_18_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_18_0_ENABLE           ((uint32_t)0x00000100U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_17_3] Bits */
#define LFSS_SPMTERASE4_TE_17_3_OFS              (7)                             /* !< TE_17_3 Offset */
#define LFSS_SPMTERASE4_TE_17_3_MASK             ((uint32_t)0x00000080U)         /* !< tamper erase enable SPMEM17 - DATA3 */
#define LFSS_SPMTERASE4_TE_17_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_17_3_ENABLE           ((uint32_t)0x00000080U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_17_2] Bits */
#define LFSS_SPMTERASE4_TE_17_2_OFS              (6)                             /* !< TE_17_2 Offset */
#define LFSS_SPMTERASE4_TE_17_2_MASK             ((uint32_t)0x00000040U)         /* !< tamper erase enable SPMEM17 - DATA2 */
#define LFSS_SPMTERASE4_TE_17_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_17_2_ENABLE           ((uint32_t)0x00000040U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_17_1] Bits */
#define LFSS_SPMTERASE4_TE_17_1_OFS              (5)                             /* !< TE_17_1 Offset */
#define LFSS_SPMTERASE4_TE_17_1_MASK             ((uint32_t)0x00000020U)         /* !< tamper erase enable SPMEM17 - DATA1 */
#define LFSS_SPMTERASE4_TE_17_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_17_1_ENABLE           ((uint32_t)0x00000020U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_17_0] Bits */
#define LFSS_SPMTERASE4_TE_17_0_OFS              (4)                             /* !< TE_17_0 Offset */
#define LFSS_SPMTERASE4_TE_17_0_MASK             ((uint32_t)0x00000010U)         /* !< tamper erase enable SPMEM17 - DATA0 */
#define LFSS_SPMTERASE4_TE_17_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_17_0_ENABLE           ((uint32_t)0x00000010U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_16_3] Bits */
#define LFSS_SPMTERASE4_TE_16_3_OFS              (3)                             /* !< TE_16_3 Offset */
#define LFSS_SPMTERASE4_TE_16_3_MASK             ((uint32_t)0x00000008U)         /* !< tamper erase enable SPMEM16 - DATA3 */
#define LFSS_SPMTERASE4_TE_16_3_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_16_3_ENABLE           ((uint32_t)0x00000008U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_16_2] Bits */
#define LFSS_SPMTERASE4_TE_16_2_OFS              (2)                             /* !< TE_16_2 Offset */
#define LFSS_SPMTERASE4_TE_16_2_MASK             ((uint32_t)0x00000004U)         /* !< tamper erase enable SPMEM16 - DATA2 */
#define LFSS_SPMTERASE4_TE_16_2_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_16_2_ENABLE           ((uint32_t)0x00000004U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_16_1] Bits */
#define LFSS_SPMTERASE4_TE_16_1_OFS              (1)                             /* !< TE_16_1 Offset */
#define LFSS_SPMTERASE4_TE_16_1_MASK             ((uint32_t)0x00000002U)         /* !< tamper erase enable SPMEM16 - DATA1 */
#define LFSS_SPMTERASE4_TE_16_1_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_16_1_ENABLE           ((uint32_t)0x00000002U)         /* !< SPMEM will be erased with tamper
                                                                                    event */
/* LFSS_SPMTERASE4[TE_16_0] Bits */
#define LFSS_SPMTERASE4_TE_16_0_OFS              (0)                             /* !< TE_16_0 Offset */
#define LFSS_SPMTERASE4_TE_16_0_MASK             ((uint32_t)0x00000001U)         /* !< tamper erase enable SPMEM16 - DATA0 */
#define LFSS_SPMTERASE4_TE_16_0_DISABLE          ((uint32_t)0x00000000U)         /* !< SPMEM is unmodified during tamper
                                                                                    event */
#define LFSS_SPMTERASE4_TE_16_0_ENABLE           ((uint32_t)0x00000001U)         /* !< SPMEM will be erased with tamper
                                                                                    event */

