MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l11/thirdparty/mspm0l11/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_CPU_INT_MIS Bits */
/* LFSS_CPU_INT_MIS[RTCRDY] Bits */
#define LFSS_CPU_INT_MIS_RTCRDY_OFS              (0)                             /* !< RTCRDY Offset */
#define LFSS_CPU_INT_MIS_RTCRDY_MASK             ((uint32_t)0x00000001U)         /* !< RTC ready */
#define LFSS_CPU_INT_MIS_RTCRDY_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RTCRDY_SET              ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RTCTEV] Bits */
#define LFSS_CPU_INT_MIS_RTCTEV_OFS              (1)                             /* !< RTCTEV Offset */
#define LFSS_CPU_INT_MIS_RTCTEV_MASK             ((uint32_t)0x00000002U)         /* !< RTC time event */
#define LFSS_CPU_INT_MIS_RTCTEV_CLR              ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RTCTEV_SET              ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RTCA1] Bits */
#define LFSS_CPU_INT_MIS_RTCA1_OFS               (2)                             /* !< RTCA1 Offset */
#define LFSS_CPU_INT_MIS_RTCA1_MASK              ((uint32_t)0x00000004U)         /* !< RTC alarm 1 */
#define LFSS_CPU_INT_MIS_RTCA1_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RTCA1_SET               ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RTCA2] Bits */
#define LFSS_CPU_INT_MIS_RTCA2_OFS               (3)                             /* !< RTCA2 Offset */
#define LFSS_CPU_INT_MIS_RTCA2_MASK              ((uint32_t)0x00000008U)         /* !< RTC alarm 2 */
#define LFSS_CPU_INT_MIS_RTCA2_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RTCA2_SET               ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RT0PS] Bits */
#define LFSS_CPU_INT_MIS_RT0PS_OFS               (4)                             /* !< RT0PS Offset */
#define LFSS_CPU_INT_MIS_RT0PS_MASK              ((uint32_t)0x00000010U)         /* !< RTC prescale timer 0 */
#define LFSS_CPU_INT_MIS_RT0PS_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RT0PS_SET               ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RT1PS] Bits */
#define LFSS_CPU_INT_MIS_RT1PS_OFS               (5)                             /* !< RT1PS Offset */
#define LFSS_CPU_INT_MIS_RT1PS_MASK              ((uint32_t)0x00000020U)         /* !< RTC prescale timer 1 */
#define LFSS_CPU_INT_MIS_RT1PS_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RT1PS_SET               ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[RT2PS] Bits */
#define LFSS_CPU_INT_MIS_RT2PS_OFS               (6)                             /* !< RT2PS Offset */
#define LFSS_CPU_INT_MIS_RT2PS_MASK              ((uint32_t)0x00000040U)         /* !< RTC prescale timer 2 */
#define LFSS_CPU_INT_MIS_RT2PS_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_RT2PS_SET               ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TSEVT] Bits */
#define LFSS_CPU_INT_MIS_TSEVT_OFS               (7)                             /* !< TSEVT Offset */
#define LFSS_CPU_INT_MIS_TSEVT_MASK              ((uint32_t)0x00000080U)         /* !< Time stamp event */
#define LFSS_CPU_INT_MIS_TSEVT_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TSEVT_SET               ((uint32_t)0x00000080U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO0] Bits */
#define LFSS_CPU_INT_MIS_TIO0_OFS                (8)                             /* !< TIO0 Offset */
#define LFSS_CPU_INT_MIS_TIO0_MASK               ((uint32_t)0x00000100U)         /* !< Tamper I/O 0 event */
#define LFSS_CPU_INT_MIS_TIO0_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO0_SET                ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO1] Bits */
#define LFSS_CPU_INT_MIS_TIO1_OFS                (9)                             /* !< TIO1 Offset */
#define LFSS_CPU_INT_MIS_TIO1_MASK               ((uint32_t)0x00000200U)         /* !< Tamper I/O 1 event */
#define LFSS_CPU_INT_MIS_TIO1_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO1_SET                ((uint32_t)0x00000200U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO2] Bits */
#define LFSS_CPU_INT_MIS_TIO2_OFS                (10)                            /* !< TIO2 Offset */
#define LFSS_CPU_INT_MIS_TIO2_MASK               ((uint32_t)0x00000400U)         /* !< Tamper I/O 2 event */
#define LFSS_CPU_INT_MIS_TIO2_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO2_SET                ((uint32_t)0x00000400U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO3] Bits */
#define LFSS_CPU_INT_MIS_TIO3_OFS                (11)                            /* !< TIO3 Offset */
#define LFSS_CPU_INT_MIS_TIO3_MASK               ((uint32_t)0x00000800U)         /* !< Tamper I/O 3 event */
#define LFSS_CPU_INT_MIS_TIO3_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO3_SET                ((uint32_t)0x00000800U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO4] Bits */
#define LFSS_CPU_INT_MIS_TIO4_OFS                (12)                            /* !< TIO4 Offset */
#define LFSS_CPU_INT_MIS_TIO4_MASK               ((uint32_t)0x00001000U)         /* !< Tamper I/O 4 event */
#define LFSS_CPU_INT_MIS_TIO4_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO4_SET                ((uint32_t)0x00001000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO5] Bits */
#define LFSS_CPU_INT_MIS_TIO5_OFS                (13)                            /* !< TIO5 Offset */
#define LFSS_CPU_INT_MIS_TIO5_MASK               ((uint32_t)0x00002000U)         /* !< Tamper I/O 5 event */
#define LFSS_CPU_INT_MIS_TIO5_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO5_SET                ((uint32_t)0x00002000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO6] Bits */
#define LFSS_CPU_INT_MIS_TIO6_OFS                (14)                            /* !< TIO6 Offset */
#define LFSS_CPU_INT_MIS_TIO6_MASK               ((uint32_t)0x00004000U)         /* !< Tamper I/O 6 event */
#define LFSS_CPU_INT_MIS_TIO6_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO6_SET                ((uint32_t)0x00004000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO7] Bits */
#define LFSS_CPU_INT_MIS_TIO7_OFS                (15)                            /* !< TIO7 Offset */
#define LFSS_CPU_INT_MIS_TIO7_MASK               ((uint32_t)0x00008000U)         /* !< Tamper I/O 7 event */
#define LFSS_CPU_INT_MIS_TIO7_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO7_SET                ((uint32_t)0x00008000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO8] Bits */
#define LFSS_CPU_INT_MIS_TIO8_OFS                (16)                            /* !< TIO8 Offset */
#define LFSS_CPU_INT_MIS_TIO8_MASK               ((uint32_t)0x00010000U)         /* !< Tamper I/O 8 event */
#define LFSS_CPU_INT_MIS_TIO8_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO8_SET                ((uint32_t)0x00010000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO9] Bits */
#define LFSS_CPU_INT_MIS_TIO9_OFS                (17)                            /* !< TIO9 Offset */
#define LFSS_CPU_INT_MIS_TIO9_MASK               ((uint32_t)0x00020000U)         /* !< Tamper I/O 9 event */
#define LFSS_CPU_INT_MIS_TIO9_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO9_SET                ((uint32_t)0x00020000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO10] Bits */
#define LFSS_CPU_INT_MIS_TIO10_OFS               (18)                            /* !< TIO10 Offset */
#define LFSS_CPU_INT_MIS_TIO10_MASK              ((uint32_t)0x00040000U)         /* !< Tamper I/O 10 event */
#define LFSS_CPU_INT_MIS_TIO10_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO10_SET               ((uint32_t)0x00040000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO11] Bits */
#define LFSS_CPU_INT_MIS_TIO11_OFS               (19)                            /* !< TIO11 Offset */
#define LFSS_CPU_INT_MIS_TIO11_MASK              ((uint32_t)0x00080000U)         /* !< Tamper I/O 11 event */
#define LFSS_CPU_INT_MIS_TIO11_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO11_SET               ((uint32_t)0x00080000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO12] Bits */
#define LFSS_CPU_INT_MIS_TIO12_OFS               (20)                            /* !< TIO12 Offset */
#define LFSS_CPU_INT_MIS_TIO12_MASK              ((uint32_t)0x00100000U)         /* !< Tamper I/O 12 event */
#define LFSS_CPU_INT_MIS_TIO12_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO12_SET               ((uint32_t)0x00100000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO13] Bits */
#define LFSS_CPU_INT_MIS_TIO13_OFS               (21)                            /* !< TIO13 Offset */
#define LFSS_CPU_INT_MIS_TIO13_MASK              ((uint32_t)0x00200000U)         /* !< Tamper I/O 13 event */
#define LFSS_CPU_INT_MIS_TIO13_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO13_SET               ((uint32_t)0x00200000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO14] Bits */
#define LFSS_CPU_INT_MIS_TIO14_OFS               (22)                            /* !< TIO14 Offset */
#define LFSS_CPU_INT_MIS_TIO14_MASK              ((uint32_t)0x00400000U)         /* !< Tamper I/O 14 event */
#define LFSS_CPU_INT_MIS_TIO14_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO14_SET               ((uint32_t)0x00400000U)         /* !< Interrupt occurred */
/* LFSS_CPU_INT_MIS[TIO15] Bits */
#define LFSS_CPU_INT_MIS_TIO15_OFS               (23)                            /* !< TIO15 Offset */
#define LFSS_CPU_INT_MIS_TIO15_MASK              ((uint32_t)0x00800000U)         /* !< Tamper I/O 15 event */
#define LFSS_CPU_INT_MIS_TIO15_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur or is
                                                                                    masked out */
#define LFSS_CPU_INT_MIS_TIO15_SET               ((uint32_t)0x00800000U)         /* !< Interrupt occurred */

